Revit 2027 API
CurveElement.LineStyle Property
The line style of this curve element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Element LineStyle { get; set; }
Public Property LineStyle As Element
	Get
	Set
public:
property Element^ LineStyle {
	Element^ get ();
	void set (Element^ value);
}
member LineStyle : Element with get, set
Property Value
Element
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when argument is null.
InvalidOperationException |  Thrown when regeneration failed. -- or -- Thrown when fail to get line style.
Remarks
The return of this property will be a [!:Autodesk::Revit::DB::GraphicsStyle] element. These graphics styles should be associated to subcategories of the BuiltInCategory OST_Lines.
See Also
Reference
CurveElement Class
Autodesk.Revit.DB Namespace